# Movies

NEW REPLACEMENT

This data frame lists all movies, their year, IMBD rating, IMBD votes, and their genres. The `movie_ID` column is later referenced in other data frames.

In [4]:
# import packages
import numpy as np
import pandas as pd
import re

In [5]:
# turn off pretty printing
%pprint

Pretty printing has been turned OFF

In [6]:
movies_df = pd.read_csv('./data/movie_titles_metadata.txt', sep='\s+\+\+\+\$\+\+\+\s?',
                        names=['movie_ID', 'movie_title' , 'movie_year', 'IMDB_rating', 'IMBD_votes', 'genres'], 
                        index_col='movie_ID', engine='python', encoding='ISO-8859-1')

The data was all separated with ' +++$+++ ' and did not have column names. The README described what each column was in the data so I used that to create column names. Where logical, I made the index of the df the initial ID column.

In [7]:
movies_df.shape

(617, 5)

In [8]:
# no missing values here
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 617 entries, m0 to m616
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   movie_title  617 non-null    object
 1   movie_year   617 non-null    object
 2   IMDB_rating  617 non-null    float64
 3   IMBD_votes   617 non-null    int64
 4   genres       617 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 28.9+ KB

In [9]:
movies_df.head()

,movie_title,movie_year,IMDB_rating,IMBD_votes,genres
movie_ID,,,,,
m0,10 things i hate about you,1999,6.9,62847,"['comedy', 'romance']"
m1,1492: conquest of paradise,1992,6.2,10421,"['adventure', 'biography', 'drama', 'history']"
m2,15 minutes,2001,6.1,25854,"['action', 'crime', 'drama', 'thriller']"
m3,2001: a space odyssey,1968,8.4,163227,"['adventure', 'mystery', 'sci-fi']"
m4,48 hrs.,1982,6.9,22289,"['action', 'comedy', 'crime', 'drama', 'thrill..."

In [10]:
# I do not need the IMDB information
movies_df = movies_df[['movie_title', 'movie_year', 'genres']]

In [11]:
# what is the earliest movie in the df?
movies_df['movie_year'].min()

'1927'

In [12]:
# what is the most recent movie in the df?
movies_df['movie_year'].max()

'2010'

In [13]:
# how many movies per year?
movies_df.groupby('movie_year').count()

            movie_title  genres
movie_year
1927                  2       2
1931                  2       2
1932                  4       4
1933                  2       2
1934                  3       3
...                 ...     ...
2007/I                1       1
2008                  1       1
2009                  3       3
2009/I                1       1
2010                  1       1

[88 rows x 2 columns]

Some of this data will need to be cleaned up as well.

In [22]:
movies_df['movie_year'] = movies_df.movie_year.map(lambda x: x.split('\D'))

In [20]:
movies_df = movies_df.explode('movie_year')

In [21]:
movies_df.groupby('movie_year').count()

            movie_title  genres
movie_year
1927                  2       2
1931                  2       2
1932                  4       4
1933                  2       2
1934                  3       3
...                 ...     ...
2007/I                1       1
2008                  1       1
2009                  3       3
2009/I                1       1
2010                  1       1

[88 rows x 2 columns]